system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     pisoFoam;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         20;

deltaT          0.0000002;

writeControl    timeStep;

writeInterval   5000000;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

functions
{    
forceCoeffs
{
    type                forceCoeffs;
    functionObjectLibs  ("libforces.so");
    writeControl       timeStep;
    writeInterval      10;
 
    patches             ( "Thermowell" );
    pName               p;
    UName               U;
    rho                 rhoInf;
 // rhoName             rhoInf; // OF-2.3.x
    log                 true;
     
    liftDir             (0 1 0);
    dragDir             (1 0 0);
    CofR                (0.0 0.0 0);
    pitchAxis           (0 0 1);
     
    magUInf             33.5;
    rhoInf              998;
    lRef                0.3;
    Aref                0.009;
}
}

// ************************************************************************* //
