system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale 1;

halfAngle    45.0;
radHalfAngle #calc "degToRad($halfAngle)";

//- dimensions of pipe [m]
nx     -0.15;
x      0.45;
ny     -0.18;
y      0.18;

radius 0.015;
mradius #calc "-1.0*$radius";

bradius #calc "3.0*$radius";
bmradius #calc "-3.0*$radius";

Arc  #calc "$radius*sin($radHalfAngle)";
nArc #calc "-1.0*$Arc";

Ref  #calc "3.0*$Arc";
nRef #calc "-3.0*$Arc";

grad 8;
igrad 0.125;

xunormal 50;
xdnormal 180;
ynormal 50;
refine 80;

vertices		//list of vertices defining the geometry
(
    ($nx   $ny   0)			//point 0
    ($nRef $ny   0)			//point 1
	($nRef $nRef 0)			//point 2
	($nx   $nRef 0)			//point 3
    ($nx   $ny   0.3)		//point 4
    ($nRef $ny   0.3)		//point 5
	($nRef $nRef 0.3)		//point 6
	($nx   $nRef 0.3)		//point 7
	
    ($nx   $Ref 0)			//point 8
    ($nRef $Ref 0)			//point 9
	($nRef $y   0)			//point 10
	($nx   $y   0)			//point 11
    ($nx   $Ref 0.3)		//point 12
    ($nRef $Ref 0.3)		//point 13
	($nRef $y   0.3)		//point 14
	($nx   $y   0.3)		//point 15
	
    ($Ref $ny   0)			//point 16
    ($x   $ny   0)			//point 17
	($x   $nRef 0)			//point 18
	($Ref $nRef 0)			//point 19
    ($Ref $ny   0.3)		//point 20
    ($x   $ny   0.3)		//point 21
	($x   $nRef 0.3)		//point 22
	($Ref $nRef 0.3)		//point 23
	
    ($Ref $Ref  0)			//point 24
    ($x   $Ref  0)			//point 25
	($x   $y    0)			//point 26
	($Ref $y    0)			//point 27
    ($Ref $Ref  0.3)		//point 28
    ($x   $Ref  0.3)		//point 29
	($x   $y    0.3)		//point 30
	($Ref $y    0.3)		//point 31
	
	($nArc $nArc 0)			//point 32
	($Arc $nArc 0)			//point 33
	($Arc $Arc 0)			//point 34
	($nArc $Arc 0)			//point 35
	($nArc $nArc 0.3)		//point 36
	($Arc $nArc 0.3)		//point 37
	($Arc $Arc 0.3)			//point 38
	($nArc $Arc 0.3)		//point 39
	
);

blocks			//defining the block which the geometry is made out of
(
    hex (0 1 2 3 4 5 6 7)         ($xunormal $ynormal 100) simpleGrading ($igrad $igrad 1)
    hex (8 9 10 11 12 13 14 15)   ($xunormal $ynormal 100) simpleGrading ($igrad $grad 1)
	hex (3 2 9 8 7 6 13 12)       ($xunormal $refine 100) simpleGrading ($igrad 1 1)

    hex (16 17 18 19 20 21 22 23) ($xdnormal $ynormal 100) simpleGrading ($grad $igrad 1)
    hex (24 25 26 27 28 29 30 31) ($xdnormal $ynormal 100) simpleGrading ($grad $grad 1)
	hex (19 18 25 24 23 22 29 28) ($xdnormal $refine 100) simpleGrading ($grad 1 1)

    hex (1 16 19 2 5 20 23 6)     ($refine $ynormal 100) simpleGrading (1 $igrad 1)
    hex (9 24 27 10 13 28 31 14)  ($refine $ynormal 100) simpleGrading (1 $grad 1)
	
	hex (2 19 33 32 6 23 37 36)   ($refine $refine 100) simpleGrading (1 1 1)
    hex (33 19 24 34 37 23 28 38) ($refine $refine 100) simpleGrading (1 1 1)
	hex (35 34 24 9 39 38 28 13)  ($refine $refine 100) simpleGrading (1 1 1)
    hex (2 32 35 9 6 36 39 13)    ($refine $refine 100) simpleGrading (1 1 1)
	
);

edges
(   
    arc 2 19 (0 $bmradius 0)
    arc 6 23 (0 $bmradius 0.3)
	
    arc 19 24 ($bradius 0 0)
	arc 23 28 ($bradius 0 0.3)
	
    arc 9 24 (0 $bradius 0)
    arc 13 28 (0 $bradius 0.3)	
	
    arc 2 9 ($bmradius 0 0)
	arc 6 13 ($bmradius 0 0.3)
	
    arc 32 33 (0 $mradius 0)
    arc 36 37 (0 $mradius 0.3)
	
    arc 33 34 ($radius 0 0)
	arc 37 38 ($radius 0 0.3)
	
    arc 35 34 (0 $radius 0)
    arc 39 38 (0 $radius 0.3)	
	
    arc 32 35 ($mradius 0 0)
	arc 36 39 ($mradius 0 0.3)	
);

boundary
(
    Symmetry	//choose a name for the boundary
    {
        type symmetry;	//define the type of the boundary
        faces
        (
			//front
            (0 1 5 4)
            (1 16 20 5)
            (16 17 21 20)
			
			//back
			(11 10 14 15)
			(10 27 31 14)
			(27 26 30 31)
		);
	}
	
	Cyc1
    {
		type cyclicAMI;
		neighbourPatch  Cyc2;
		transform       translational;
        separationVector       (0 0 0.3);
		faces
		(
			//bottom
			(0 1 2 3)
			(3 2 9 8)
			(8 9 10 11)
			(1 16 19 2)
			(2 19 33 32)
			(2 32 35 9)
			(33 19 24 34)
			(9 35 34 24)
			(9 24 27 10)
			(16 17 18 19)
			(19 18 25 24)
			(24 25 26 27)
		);
    }

	Cyc2
    {
		type cyclicAMI;
		neighbourPatch  Cyc1;
		transform       translational;
        separationVector       (0 0 -0.3);
		faces
		(		
			//top
			(4 5 6 7)
			(7 6 13 12)
			(12 13 14 15)
			(5 20 23 6)
			(6 36 39 13)
			(6 23 37 36)
			(37 23 28 38)
			(13 39 38 28)
			(13 28 31 14)
			(20 21 22 23)
			(23 22 29 28)
			(28 29 30 31)
		);
	}
    
    Inlet
    {
        type patch;
        faces
        (
            (0 3 7 4)
            (3 8 12 7)
            (8 11 15 12)
		);
    }	   	

    Outlet
    {
		type patch;
		faces
		(
			(17 18 22 21)
			(18 25 29 22)
			(25 26 30 29)
		);
    }
	
    Thermowell
    {
		type wall;
		faces
		(
			(32 33 37 36)
			(33 34 38 37)
			(35 34 38 39)
			(32 35 39 36)
		);
    }	
);


// ************************************************************************* //
