0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (33.5 0 0);

boundaryField
{
    Inlet
    {
        type            fixedValue;
        value           uniform (33.5 0 0);
    }

    Outlet
    {
        type            zeroGradient;
    }

    Thermowell
    {
        type            fixedValue;
        value			uniform (0 0 0);
    }
	
	Symmetry
    {
        type            symmetry;
    }

}

// ************************************************************************* //