0/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 135.29;

boundaryField
{

    Inlet
	{
        type            fixedValue;
        value           uniform 135.29;
    }
	
    Outlet
    {
        type            zeroGradient;
    }

    Thermowell
    {
        type            kqRWallFunction;
        value           uniform 135.29;
    }
	
	Symmetry
    {
        type            symmetry;
    }
}


// ************************************************************************* //
