system/surfaces
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
-------------------------------------------------------------------------------
Description
    Writes out surface files with interpolated field data in VTK format, e.g.
    cutting planes, iso-surfaces and patch boundary surfaces.

    This file includes a selection of example surfaces, each of which the user
    should configure and/or remove.

\*---------------------------------------------------------------------------*/

surfaces
{
#includeEtc "/mnt/c/Users/callu/OpenFoam-cases/Report-pipe/piso/r=0.429m3/system/surfaces.cfg"

fields       (p);

surfaces
(
    cylinderwalls
    {
        $patchSurface;
        patches     (cylinderwalls);

    }

);
}
// ************************************************************************* //
